In [9]:
import pandas as pd
import numpy as np

# 1. Sort DataFrame based on another list

In [25]:
df = pd.DataFrame([["A", 1],
                   ["B", 2],
                   ["C", 3],
                   ["D", 4]], columns=["col1", "col2"])

df

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4

In [3]:
sort_list = ["C", "A", "D", "B"]

In [11]:
## start your code below
new_df = ... 
## end your code here

In [4]:
new_df

# 2. Insert a column at a specific location in a DataFrame

In [30]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [31]:
new_column = ["P", "Q", "R", "S"]

insert_position = 1 ## between col_A and col_B

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 3. Select columns based on the column's Data Type

In [36]:
df = pd.DataFrame([["A", 1, True], ["B", 2, False],
                   ["C", 3, False], ["D", 4, True]], 
                  columns=["col_A", "col_B", "col_C"])

df

  col_A  col_B  col_C
0     A      1   True
1     B      2  False
2     C      3  False
3     D      4   True

In [35]:
dt_type = "bool"

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 4. Count the number of Non-NaN cells for each column

In [39]:
df = pd.DataFrame([["A", np.NaN], [np.NaN, 2],
                   ["C", np.NaN], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A    NaN
1   NaN    2.0
2     C    NaN
3     D    4.0

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 5. Split DataFrame into equal parts

In [41]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [42]:
parts = 2

In [ ]:
## start your code below
new_df1, new_df2 = ... 
## end your code here

In [ ]:
new_df2

# 6. Reverse DataFrame row-wise or column-wise

In [46]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [ ]:
## start your code below
col_reverse = ... 
## end your code here

In [ ]:
col_reverse

In [ ]:
## start your code below
row_reverse = ... 
## end your code here

In [ ]:
row_reverse

# 7. Rearrange columns of a DataFrame

In [49]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 8. Get alternate rows of a DataFrame

In [56]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 9. Insert a row at an arbitrary position

In [62]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [63]:
insert_pos = 1
insert_row = ["P", 5]

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 10. Apply function to every cell of DataFrame

In [76]:
df = pd.DataFrame([[1, 5], [2, 6],
                   [3, 7], [4, 8]], 
                  columns=["col_A", "col_B"])

df

   col_A  col_B
0      1      5
1      2      6
2      3      7
3      4      8

In [75]:
def func(num):
    return num + 1

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df